In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame(np.arange(10, 22).reshape(3, 4), 
                 columns=['A', 'B', 'C', 'D'],
                 index=['a', 'b', 'c'])

In [3]:
df

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

In [4]:
df.iloc[0, 1]

11

In [5]:
df.iloc[:2, 2]

a    12
b    16
Name: C, dtype: int32

In [6]:
df

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

In [7]:
df.iloc[0, 2:]

C    12
D    13
Name: a, dtype: int32

In [8]:
df.iloc[0, -2:]

C    12
D    13
Name: a, dtype: int32

In [9]:
df

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

In [10]:
df.iloc[2:3, 1:3]

    B   C
c  19  20

In [11]:
df.iloc[-1]

A    18
B    19
C    20
D    21
Name: c, dtype: int32

In [12]:
df.iloc[-1] = df.iloc[-1] *2

In [13]:
df

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  36  38  40  42

In [14]:
df

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  36  38  40  42

In [15]:
df.loc['a', 'A']

10

In [16]:
%timeit df.loc['a', 'A']

6.66 µs ± 31 ns per loop (mean ± std. dev. of 7 runs, 100000 loops each)

In [17]:
%timeit 
df.loc['a', 'A']

10

In [18]:
%timeit df.loc['a', 'A']

%timeit df.at['a', 'A']

%timeit df.iloc[0, 0]

%timeit df.iat[0, 0]

6.82 µs ± 309 ns per loop (mean ± std. dev. of 7 runs, 100000 loops each)
4.26 µs ± 107 ns per loop (mean ± std. dev. of 7 runs, 100000 loops each)
7.72 µs ± 219 ns per loop (mean ± std. dev. of 7 runs, 100000 loops each)
4.68 µs ± 121 ns per loop (mean ± std. dev. of 7 runs, 100000 loops each)